docs: update 11 doc pages from gitbook_section_3
